hot/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       361932;
    }
    minX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       362832;
    }
    maxX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       363732;
    }
    minY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       364632;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       365532;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       366432;
    }
)

// ************************************************************************* //
