hot/system/ellipse/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
   
}

T
{
    internalField   uniform 400;

    boundaryField
    {
        ".*"
        {
            type            zeroGradient;
            value           uniform 400;
        }
        "procBoundary.*"
        {
            type            processor;
        }
        "ellipse_to_.*"
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           uniform 400;
        }  
    }
    ellipse_to_fluid
    {
        type            calculated;
        value           uniform 400;
    }
}

// ************************************************************************* //
